tutorials/ico4MLFoam/lidDrivenCavity/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 303;

boundaryField
{
    movingWall
    {
        type            fixedValue;
        value           333;
    }

    fixedWalls
    {
        type            fixedValue;
        value           303;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
